Оборудование/src/Documents/ВыбытиеОборудования/ВыбытиеОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыбытиеОборудования</name>
  <registerRecords>AccumulationRegister.Остатки</registerRecords>
  <tabularSections>
    <name>Оборудование</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Субъект</name>
      <type>
        <types>CatalogRef.Субъекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Оборудование/src/AccumulationRegisters/Остатки/Остатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Остатки</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Субъект</name>
    <type>
      <types>CatalogRef.Субъекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Оборудование/src/Documents/ВыбытиеОборудования/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Остатки Расход
	Движения.Остатки.Записывать = Истина;
	Для Каждого ТекСтрокаОборудование Из Оборудование Цикл
		Движение = Движения.Остатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаОборудование.Номенклатура;
		Движение.Субъект = ТекСтрокаОборудование.Субъект;
		Движение.Количество = ТекСтрокаОборудование.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
